Revit 2027 API
ParameterDownloadOptions Methods
The ParameterDownloadOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCategories |  Get categories for binding.
GetGroupTypeId |  Get properties palette group identifier.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetCategories |  Set categories for binding.
SetGroupTypeId |  Set properties palette group identifier.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace